{
  "history_articles": [
    {
      "id": 1,
      "title": "Основные даты",
      "img_src": "https://via.placeholder.com/70x75",
      "main_text": "1920-1930: Потребность Уральского региона в собственном высшем учебном заведении стала очевидной еще в XVIII в., но первый университет России к востоку от Волги был открыт только в 1878 г. в Томске. В 1890-е гг. дискуссия о создании высшего учебного заведения в Екатеринбурге вспыхнула с новой силой. Проект учреждения Уральского университета разрабатывался на самом высшем уровне — в Совете народных комиссаров.Начали зарождаться научные направления и научные школы. Были достигнуты успехи в исследовании металлургических процессов, электрохимии, заложены научные основы конструирования аппаратов химической технологии, началась подготовка кадров высшей квалификации. Укреплялась связь науки с производством. 1930-1940: К началу 40-х годов Втузгородок являлся уникальным для всей страны комплексом учебных корпусов, жилых зданий, общежитий для студентов.1940-1950: За годы Великой Отечественной войны из института и университета ушло на фронт около 2400 человек. Они сражались под Москвой, Сталинградом, Киевом, Севастополем, Кенигсбергом, на Курской Дуге, освобождали Австрию, Венгрию, Германию, Польшу, Румынию, Чехословакию, Югославию, Китай, Корею. Более 300 человек погибли. Среди наших студентов, выпускников и преподавателей 14 Героев Советского Союза. В память о погибших воинах на средства студентов и сотрудников сооружен величественный памятник, установленный около одного из учебных корпусов. 1950-1960: В эти годы в университете складываются ключевые научные школы, развивается материальная база, увеличивается студенческий контингент. Происходят изменения в учебном процессе и в УПИ: увеличивается объем физико-математических наук, активно внедряются технические средства обучения и программированный контроль. К концу этого десятилетия руками студентов закончено благоустройство площади имени Кирова. 1960-1970: В УПИ — 26 тысяч студентов, среди преподавателей — один академик, 58 профессоров, 3473 доцента и кандидата, 338 старших преподавателей, 619 ассистентов и преподавателей. 1970-1980: В эти годы УПИ остается крупнейшим вузом по выпуску квалифицированных кадров для страны, в институте обучается свыше 26 тысяч человек. 1980-1990: Университет и институт празднуют 60-летие с момента основания. Университет выпускает 25-тысячного специалиста. В составе первой советской гималайской экспедиции сотрудник кафедры экспериментальной физики УПИ С. Б. Ефимов поднялся на высочайшую вершину мира «Эверест». 1990-2000При Уральском университете открыт Учебно-научный центр для одаренных детей (СУНЦ). Число выпускников Уральского политехнического института — 125 тысяч. 2000-2010: В это десятилетие в УрГУ начинают работать: факультет международных отношений и факультет связей с общественностью и рекламы. Крупным стратегическим прорывом явилось создание межвузовского и межфакультетского научно-образовательного центра «Перспективные материалы», а также Уральского Межрегионального института общественных наук. В УГТУ-УПИ созданы Институт образовательных информационных технологий и факультет информационно-математических технологий и экономического моделирования. 2010-2020: На базе УрФУ проведен юбилейный Х Форум «Петербургский диалог» с участием Президента РФ Д. Медведева и канцлера Германии А. Меркель. В Институте радиоэлектроники и информационных технологий УрФУ открыт центр электромагнитных измерений."
    },
    {
      "id": 2,
      "title": "Преподавательский состав",
      "img_src": "https://via.placeholder.com/70x75",
      "main_text": "any article text 2"
    },
    {
      "id": 3,
      "title": "История реорганизации и переименования университета",
      "img_src": "https://via.placeholder.com/70x75",
      "main_text": "any article 3"
    },
    {
      "id": 4,
      "title": "Имени Ельцина",
      "img_src": "https://via.placeholder.com/70x75",
      "main_text": "any article 4"
    },
    {
      "id": 5,
      "title": "Музейно-выставочный комплекс",
      "img_src": "https://via.placeholder.com/70x75",
      "main_text": "any article text 5"
    },
    {
      "id": 6,
      "title": "Онлайн-музей",
      "img_src": "https://via.placeholder.com/70x75",
      "main_text": "any article 6"
    }
  ],
  "academic_building_articles": [
    {
      "id": 1,
      "title": "Институт радиоэлектроники и информационных технологий-РТФ",
      "img_src": "https://via.placeholder.com/350x250",
      "main_text": "Институт радиоэлектроники и информационных технологий - РТФ - это один из крупнейших институтов Урала, осуществляющи подготовку профессионалов ИТ-сферы, информационной безопасности и защиты информации, а также специалистов в разработке систем IoT,  радиотехнике, электронике и системах связи. Его отличает индивидуальный подход к каждому студенту, многопрофильность и большой спектр возможностей, доступных обучающимся. Благодаря сотрудничеству с ведущими предприятиями и компаниями региона и страны институт постоянно развивается и совершенствуется: открываются новые научные центры и лаборатории, проводятся научно-практические конференции, а также реализуются совместные проекты студентов с партнерами-заказчиками. В ИРИТ-РТФ существует возможность осваивать образовательные программы по очной форме обучения, а также по очно-заочной и заочной ускоренной формам обучения, в зависимости от индивидуальных возможностей и желания поступающего. Любой абитуриент может поступить как на бюджетную основу(более 1200 бюджетных мест), так и с полным возмещением затрат (контракт). Наш институт дает возможность каждому студенту выстраивать гибкий график учебы, получать социальную поддержку(материальная помощь), а также предоставляет отсрочку от армии. Кроме того, можно получить дополнительное образование."
    },
    {
      "id": 2,
      "title": "any title 2",
      "img_src": "https://via.placeholder.com/350x250",
      "main_text": "123"
    },
    {
      "id": 3,
      "title": "any title 3",
      "img_src": "https://via.placeholder.com/350x250",
      "main_text": "123"
    },
    {
      "id": 4,
      "title": "any title 4",
      "img_src": "https://via.placeholder.com/350x250",
      "main_text": "123"
    },
    {
      "id": 5,
      "title": "any title 5",
      "img_src": "https://via.placeholder.com/350x250",
      "main_text": "123"
    },
    {
      "id": 6,
      "title": "any title 6",
      "img_src": "https://via.placeholder.com/350x250",
      "main_text": "123"
    }
  ],
  "campus_buildings_articles": [
    {
      "id": 1,
      "title": "Студенческое общежитие №11",
      "img_src": "https://via.placeholder.com/350x250",
      "main_text": "Студенческое общежитие №11 – общежитие для студентов, находится по адресу ул. Коминтерна, д. 5, было построено в 1961 году, в 2016 был произведен капитальный ремонт. Здание имеет 5 этажей и 220 жилых комнат. На каждом этаже есть кухня. На данный момент в общежитии проживает 597 студентов таких институтов,'как ИРИТ-РтФ, ИНМТ, ИнЭУ и ИнФО. В фойе первого этажа любой студент может поиграть в настольный теннис. С 2012 года открыта комната для занятий. Режим работы: Пн – чт. 8:30-17:15; пт. 8:30-16:00.Совет студенческого корпуса избирается ежегодно студентами, проживающими в общежитии. В функции ССК входит представление прав и интересов, проживающих перед администрацией университета, привлечение студентов к решению социально-значимых вопросов, организация воспитательного процесса, досуга и быта проживающих, контроль за соблюдением правил внутреннего распорядка и нормативно-правовых актов, регулирующих проживание студентов в общежитии."
    },
    {
      "id": 2,
      "title": "any title 2",
      "img_src": "https://via.placeholder.com/350x250",
      "main_text": "123"
    },
    {
      "id": 3,
      "title": "any title 3",
      "img_src": "https://via.placeholder.com/350x250",
      "main_text": "123"
    },
    {
      "id": 4,
      "title": "any title 4",
      "img_src": "https://via.placeholder.com/350x250",
      "main_text": "123"
    },
    {
      "id": 5,
      "title": "any title 5",
      "img_src": "https://via.placeholder.com/350x250",
      "main_text": "123"
    },
    {
      "id": 6,
      "title": "any title 6",
      "img_src": "https://via.placeholder.com/350x250",
      "main_text": "141"
    }
  ]
}
