<script>

export default {
  data() {
    return {
      posts:
          [
            {
              id: 1,
              title: 'Основные даты',
              main_text: '1920-1930: ' +
                  'Потребность Уральского региона в собственном высшем учебном заведении стала очевидной еще в XVIII в., но первый университет России к востоку от Волги был открыт только в 1878 г. в Томске. В 1890-е гг. дискуссия о создании высшего учебного заведения в Екатеринбурге вспыхнула с новой силой.\n' +
                  '\n' +
                  'Проект учреждения Уральского университета разрабатывался на самом высшем уровне — в Совете народных комиссаров.\n' +
                  'Начали зарождаться научные направления и научные школы. Были достигнуты успехи в исследовании металлургических процессов, электрохимии, заложены научные основы конструирования аппаратов химической технологии, началась подготовка кадров высшей квалификации. Укреплялась связь науки с производством.' +
                  '\n' +
                  '1930-1940: К началу 40-х годов Втузгородок являлся уникальным для всей страны комплексом учебных корпусов, жилых зданий, общежитий для студентов.' +
                  '\n' +
                  '1940-1950: За годы Великой Отечественной войны из института и университета ушло на фронт около 2400 человек. Они сражались под Москвой, Сталинградом, Киевом, Севастополем, Кенигсбергом, на Курской Дуге, освобождали Австрию, Венгрию, Германию, Польшу, Румынию, Чехословакию, Югославию, Китай, Корею. ' +
                  'Более 300 человек погибли. Среди наших студентов, выпускников и преподавателей 14 Героев Советского Союза. В память о погибших воинах на средства студентов и сотрудников сооружен величественный памятник, установленный около одного из учебных корпусов.' +
                  '\n' +
                  '1950-1960: В эти годы в университете складываются ключевые научные школы, развивается материальная база, увеличивается студенческий контингент. Происходят изменения в учебном процессе и в УПИ: увеличивается объем физико-математических наук, активно внедряются технические средства обучения и программированный контроль.' +
                  '\n' +
                  'К концу этого десятилетия руками студентов закончено благоустройство площади имени Кирова.' +
                  '\n' +
                  '1960-1970: В УПИ — 26 тысяч студентов, среди преподавателей — один академик, 58 профессоров, 3473 доцента и кандидата, 338 старших преподавателей, 619 ассистентов и преподавателей.' +
                  '\n' +
                  '1970-1980: В эти годы УПИ остается крупнейшим вузом по выпуску квалифицированных кадров для страны, в институте обучается свыше 26 тысяч человек.' +
                  '\n' +
                  '1980-1990: Университет и институт празднуют 60-летие с момента основания. Университет выпускает 25-тысячного специалиста. В составе первой советской гималайской экспедиции сотрудник кафедры экспериментальной физики УПИ С. Б. Ефимов поднялся на высочайшую вершину мира «Эверест».' +
                  '\n' +
                  '1990-2000При Уральском университете открыт Учебно-научный центр для одаренных детей (СУНЦ). Число выпускников Уральского политехнического института — 125 тысяч.' +
                  '\n' +
                  '2000-2010: В это десятилетие в УрГУ начинают работать: факультет международных отношений и факультет связей с общественностью и рекламы. Крупным стратегическим прорывом явилось создание межвузовского и межфакультетского научно-образовательного центра «Перспективные материалы», а также Уральского Межрегионального института общественных наук.\n' +
                  '\n' +
                  'В УГТУ-УПИ созданы Институт образовательных информационных технологий и факультет информационно-математических технологий и экономического моделирования.\n' +
                  '2010-2020: На базе УрФУ проведен юбилейный Х Форум «Петербургский диалог» с участием Президента РФ Д. Медведева и канцлера Германии А. Меркель. В Институте радиоэлектроники и информационных технологий УрФУ открыт центр электромагнитных измерений.'
            },
            {
              id: 2,
              title: 'Преподавательский состав',
              main_text: 'any article text 2'
            },
            {
              id: 3,
              title: 'История реорганизации и переименования университета',
              main_text: 'any article 3'
            },
            {
              id: 4,
              title: 'Имени Ельцина',
              main_text: 'any article 4'
            },
            {
              id: 5,
              title: 'Музейно-выставочный комплекс',
              main_text: 'any article text 5'
            },
            {
              id: 6,
              title: 'Онлайн-музей',
              main_text: 'any article 6'
            },
          ]
    }
  }
}

</script>

<template>
  <blocks-list-page title="История УрФУ" small_title="Как зарождался Уральский Федеральный?" :posts="this.posts"/>
</template>

<style scoped>

</style>
